Repository: mksddn/WP-MksDdn-Forms-Handler
Catalog: mksddn-forms-handler/trunk/languages/mksddn-forms-handler-*.po
Languages: ru_ru

source: Export by Date
ru_ru: Экспорт по дате

source: Spam detected
ru_ru: Обнаружен спам

source: Too many requests. Please wait a few seconds.
ru_ru: Слишком много запросов. Пожалуйста, подождите несколько секунд.

source: Invalid form data
ru_ru: Неверные данные формы

source: Too many form fields submitted
ru_ru: Отправлено слишком много полей формы

source: Form data is too large
ru_ru: Данные формы слишком большие

source: Invalid slug
ru_ru: Неверный слаг

source: Form not found
ru_ru: Форма не найдена

source: Security check failed. Please refresh the page and try again.
ru_ru: Проверка безопасности не пройдена. Пожалуйста, обновите страницу и попробуйте снова.

source: Unauthorized fields detected: %s
ru_ru: Обнаружены неавторизованные поля: %s

source: Failed to deliver form submission
ru_ru: Не удалось доставить отправку формы

source: Form submitted successfully
ru_ru: Форма успешно отправлена

source: Form is not configured correctly
ru_ru: Форма настроена неверно

source: Form fields configuration is missing
ru_ru: Конфигурация полей формы отсутствует

source: Failed to send email
ru_ru: Не удалось отправить email

source: Form Data: %s
ru_ru: Данные формы: %s

source: Field
ru_ru: Поле

source: Value
ru_ru: Значение

source: Sent: %s
ru_ru: Отправлено: %s

source: Page URL
ru_ru: URL страницы

source: Error: form ID or slug not specified
ru_ru: Ошибка: не указан ID или slug формы

source: Thank you! Your message has been sent successfully.
ru_ru: Спасибо! Ваше сообщение успешно отправлено.

source: Send
ru_ru: Отправить

source: Sending...
ru_ru: Отправка...

source: Error
ru_ru: Ошибка

source: An error occurred while sending the form
ru_ru: Произошла ошибка при отправке формы

source: Unauthorized fields:
ru_ru: Неавторизованные поля:

source: Allowed fields:
ru_ru: Разрешенные поля:

source: Delivery Status:
ru_ru: Статус доставки:

source: Email: Sent successfully
ru_ru: Email: Отправлено успешно

source: Telegram: Sent successfully
ru_ru: Telegram: Отправлено успешно

source: Google Sheets: Data saved
ru_ru: Google Таблицы: Данные сохранены

source: Google Sheets:
ru_ru: Google Таблицы:

source: Failed
ru_ru: Не удалось

source: Recipients
ru_ru: Получатели

source: Admin Storage
ru_ru: Хранилище админки

source: Shortcode
ru_ru: Шорткод

source: Export
ru_ru: Экспорт

source: ✓ Enabled
ru_ru: ✓ Включено

source: ✗ Disabled
ru_ru: ✗ Выключено

source: No submissions
ru_ru: Нет отправок

source: Form
ru_ru: Форма

source: Date
ru_ru: Дата

source: Data
ru_ru: Данные

source: Delivery Status
ru_ru: Статус доставки

source: Form deleted
ru_ru: Форма удалена

source: Unknown form
ru_ru: Неизвестная форма

source: %d items
ru_ru: %d элементов

source: No data
ru_ru: Нет данных

source: Unknown
ru_ru: Неизвестно

source: Google Sheets Settings
ru_ru: Настройки Google Sheets

source: Access denied
ru_ru: Доступ запрещен

source: Security check failed
ru_ru: Проверка безопасности не пройдена

source: Spreadsheet ID is required.
ru_ru: Укажите ID таблицы.

source: ✅ Google Sheets connection successful!
ru_ru: ✅ Подключение к Google Таблицам успешно!

source: ❌ Google Sheets connection failed: %s
ru_ru: ❌ Ошибка подключения к Google Таблицам: %s

source: Export Submissions
ru_ru: Экспорт обращений

source: Please select a form to export.
ru_ru: Пожалуйста, выберите форму для экспорта.

source: Form not found.
ru_ru: Форма не найдена.

source: Unknown Form
ru_ru: Неизвестная форма

source: Select a form to export all its submissions to CSV:
ru_ru: Выберите форму для экспорта всех её обращений в CSV:

source: Export All
ru_ru: Экспортировать все

source: Date From
ru_ru: Дата с

source: Date To
ru_ru: Дата по

source: Cancel
ru_ru: Отмена

source: Form Settings
ru_ru: Настройки формы

source: Submission Data
ru_ru: Данные отправки

source: Submission Info
ru_ru: Информация об отправке

source: Error: Invalid JSON in Fields Configuration! Check syntax.
ru_ru: Ошибка: неверный JSON в конфигурации полей! Проверьте синтаксис.

source: No data available
ru_ru: Данные недоступны

source: Form:
ru_ru: Форма:

source: Date:
ru_ru: Дата:

source: IP Address:
ru_ru: IP-адрес:

source: New message from website
ru_ru: Новое сообщение с сайта

source: Forms
ru_ru: Формы

source: Add Form
ru_ru: Добавить форму

source: Add New Form
ru_ru: Добавить новую форму

source: Edit Form
ru_ru: Редактировать форму

source: New Form
ru_ru: Новая форма

source: View Form
ru_ru: Просмотр формы

source: Search Forms
ru_ru: Поиск форм

source: No forms found
ru_ru: Формы не найдены

source: No forms found in trash
ru_ru: В корзине форм не найдено

source: Form Submissions
ru_ru: Обращения

source: Submission
ru_ru: Обращение

source: Submissions
ru_ru: Обращения

source: Add Submission
ru_ru: Добавить обращение

source: Add New Submission
ru_ru: Добавить новое обращение

source: Edit Submission
ru_ru: Редактировать обращение

source: New Submission
ru_ru: Новое обращение

source: View Submission
ru_ru: Просмотр обращения

source: Search Submissions
ru_ru: Поиск обращений

source: No submissions found
ru_ru: Обращения не найдены

source: No submissions found in trash
ru_ru: В корзине обращений не найдено

source: Form Fields
ru_ru: Поля формы

source: Email Settings
ru_ru: Настройки email

source: Display
ru_ru: Отображение

source: Advanced
ru_ru: Расширенные

source: Fields Configuration
ru_ru: Конфигурация полей

source: JSON configuration of form fields. Example: [{"name": "name", "label": "Name", "type": "text", "required": true}]
ru_ru: JSON-конфигурация полей формы. Пример: [{"name": "name", "label": "Имя", "type": "text", "required": true}]

source: Pattern note:
ru_ru: О паттернах:

source: For regex patterns, use double backslashes in JSON (e.g., "pattern": "^\\+?\\d{7,15}$")
ru_ru: Для regex-паттернов используйте двойные обратные слеши в JSON (например, "pattern": "^\\+?\\d{7,15}$")

source: Send to Email
ru_ru: Отправлять на Email

source: Enable email notifications for this form
ru_ru: Включить уведомления на email для этой формы

source: Recipients (comma separated)
ru_ru: Получатели (через запятую)

source: Email addresses separated by commas
ru_ru: Email-адреса, разделенные запятыми

source: BCC Recipient
ru_ru: Получатель BCC

source: Specified for debugging
ru_ru: Указывается для отладки

source: Email Subject
ru_ru: Тема письма

source: Send to Telegram
ru_ru: Отправлять в Telegram

source: Enable Telegram notifications for this form
ru_ru: Включить уведомления Telegram для этой формы

source: Telegram Bot Token
ru_ru: Токен бота Telegram

source: Your Telegram bot token (e.g., 123456789:ABCdefGHIjklMNOpqrsTUVwxyz)
ru_ru: Токен вашего бота Telegram (например, 123456789:ABCdefGHIjklMNOpqrsTUVwxyz)

source: Telegram Chat IDs
ru_ru: ID чатов Telegram

source: Chat IDs separated by commas (e.g., -1001234567890, -1009876543210)
ru_ru: ID чатов, разделенные запятыми (например, -1001234567890, -1009876543210)

source: Send to Google Sheets
ru_ru: Отправлять в Google Таблицы

source: Enable Google Sheets integration for this form
ru_ru: Включить интеграцию с Google Таблицами для этой формы

source: Spreadsheet ID
ru_ru: ID таблицы

source: Google Sheets spreadsheet ID (from URL: docs.google.com/spreadsheets/d/SPREADSHEET_ID)
ru_ru: ID таблицы Google Sheets (из URL: docs.google.com/spreadsheets/d/SPREADSHEET_ID)

source: Sheet Name
ru_ru: Название листа

source: Sheet name (optional, defaults to first sheet)
ru_ru: Название листа (необязательно, по умолчанию первый лист)

source: Save submissions to admin panel
ru_ru: Сохранять отправки в админ-панели

source: Enable saving form submissions to admin panel for viewing and export
ru_ru: Включить сохранение отправок формы в админ-панели для просмотра и экспорта

source: Submit Button Text
ru_ru: Текст кнопки отправки

source: Custom text for the submit button. Leave empty to use default "Send"
ru_ru: Пользовательский текст для кнопки отправки. Оставьте пустым для использования значения по умолчанию "Отправить"

source: Custom HTML/Text After Button
ru_ru: Пользовательский HTML/текст после кнопки

source: Custom HTML or text to display after the submit button (e.g., privacy policy notice)
ru_ru: Пользовательский HTML или текст для отображения после кнопки отправки (например, уведомление о политике конфиденциальности)

source: Success Message Text
ru_ru: Текст сообщения об успехе

source: Custom text to display after successful form submission. Leave empty to use default message.
ru_ru: Пользовательский текст для отображения после успешной отправки формы. Оставьте пустым для использования сообщения по умолчанию.

source: Custom CSS Classes
ru_ru: Пользовательские CSS классы

source: Additional CSS classes to add to the form element. Separate multiple classes with spaces.
ru_ru: Дополнительные CSS классы для добавления к элементу формы. Разделяйте несколько классов пробелами.

source: Redirect URL After Submission
ru_ru: URL для редиректа после отправки

source: URL or relative path to redirect to after successful form submission (e.g., https://example.com/page or /thank-you). Leave empty to show success message without redirect.
ru_ru: URL или относительный путь для перенаправления после успешной отправки формы (например, https://example.com/page или /thank-you). Оставьте пустым, чтобы показать сообщение об успехе без редиректа.

source: Accept any fields from frontend
ru_ru: Принимать любые поля с фронтенда

source: Warning:
ru_ru: Предупреждение:

source: When enabled, the form will accept ANY field names from frontend submissions without validation against Fields Configuration. Use this for custom forms where you control field names in templates. All fields will still be sanitized but type validation will be skipped.
ru_ru: При включении форма будет принимать ЛЮБЫЕ имена полей из отправок с фронтенда без проверки по конфигурации полей. Используйте это для пользовательских форм, где вы контролируете имена полей в шаблонах. Все поля все равно будут санитизированы, но проверка типов будет пропущена.

source: New Form Submission
ru_ru: Новая отправка формы

source: Time:
ru_ru: Время:

source: Form Data:
ru_ru: Данные формы:

source: Failed to send Telegram request:
ru_ru: Не удалось отправить запрос в Telegram:
